# RebarElemHookStartOrient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElemHookStartOrient Property
ParameterTypeId Class See Also
---
"Hook Orientation At Start"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElemHookStartOrient { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElemHookStartOrient As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElemHookStartOrient {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace